import React from "react";

import styles from "./_hero.module.scss";

import BluredBlob from "@/components/bluredBlob";

import Link from "next/link";
import Image from "next/image";

const Hero = () => {
  return (
    <div className={styles.container}>
      <BluredBlob right={-130} top={-130} zIndex={0} opacity={0.5} />
      <div className={styles.row}>
        <div className={styles.textContainer}>
          <section className={styles.text}>
            <h3>
              سبکی متفاوت از
              <svg
                width="185"
                height="29"
                viewBox="0 0 185 29"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M49.7757 17.078C41.9136 19.6987 32.8363 22.3068 24.104 22.958C16.6403 23.5138 9.43106 22.6505 3.53018 18.9773C1.8981 17.9613 2.34582 18.0146 1.20686 19.7728C-0.0295211 21.6814 0.315387 21.2872 1.8981 22.4447C8.33522 26.4507 16.1843 27.4985 24.3255 26.8914C33.2149 26.2291 42.456 23.6037 50.4759 20.9451C51.4064 23.1125 53.3334 25.1332 56.7279 26.6241C61.9416 28.9144 69.0604 28.886 76.5597 27.5954C87.4364 25.7245 99.1367 21.2629 106.659 18.0927C106.968 17.9634 107.427 17.7576 107.99 17.4864C108.161 17.9216 108.353 18.3505 108.566 18.7715C110.41 22.4408 113.675 25.4076 117 26.4672C138.094 33.1861 162.712 25.1356 182.757 18.5839C184.781 18.1335 184.438 18.1628 183.936 16.1493C183.351 13.7972 183.752 14.1599 181.817 14.7924C162.335 21.1612 138.416 29.1967 117.913 22.6678C115.389 21.8636 112.934 19.5836 111.535 16.7989C111.377 16.4883 111.24 16.1705 111.11 15.8481C113.873 14.2736 117.124 12.0787 118.873 9.72921C120.669 7.32061 121.115 4.7496 119.551 2.32129C118.207 0.245392 116.171 0.0687842 114.052 1.14497C111.768 2.29763 109.416 4.99239 108.655 6.257C107.229 8.61909 106.776 11.1815 107.037 13.6799C106.364 14.0063 105.819 14.2492 105.482 14.3911C98.1239 17.4911 86.6876 21.8668 76.0523 23.6968C69.2092 24.8746 62.709 25.0315 57.9512 22.9422C55.9221 22.0505 54.5814 21.0098 53.8539 19.802C55.2898 19.3084 56.6744 18.8228 57.9972 18.3592C60.6133 17.4423 66.0602 15.9246 69.9519 13.2195C73.0466 11.0687 75.145 8.14293 75.023 4.47523C74.9606 2.59092 74.0122 1.33338 72.5028 0.628535C70.2474 -0.423997 66.3469 0.0853071 64.8944 0.440093C60.4892 1.51391 54.6096 5.95901 51.7006 10.9678C50.5397 12.9664 49.8491 15.0573 49.7757 17.078ZM53.3944 15.8465C54.6391 15.416 55.8419 14.9934 56.9974 14.5882C59.4393 13.732 64.544 12.3719 68.1778 9.84586C70.102 8.50871 71.6731 6.90668 71.597 4.6258C71.5908 4.4484 71.4379 4.39796 71.3028 4.32543C71.0936 4.21426 70.8543 4.13776 70.5992 4.07784C68.8731 3.6726 66.5546 4.06442 65.6056 4.29622C61.9094 5.19737 56.9925 8.95417 54.552 13.1572C54.0363 14.045 53.6255 14.9493 53.3944 15.8465ZM110.424 11.865C112.036 10.9118 113.723 9.75914 115.053 8.50478C115.759 7.83857 116.356 7.15346 116.733 6.44231C117.048 5.85416 117.172 5.25177 116.795 4.66992C116.644 4.43419 116.418 4.42949 116.184 4.47364C115.938 4.52094 115.684 4.62183 115.43 4.75192C113.757 5.59868 112.029 7.57682 111.473 8.50478C110.822 9.58096 110.5 10.7194 110.424 11.865Z"
                  fill="#070604"
                />
              </svg>
            </h3>
            <h1>
              <svg
                width="60"
                height="60"
                viewBox="0 0 60 60"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M30 0L32.8701 23.0709L51.2132 8.7868L36.9291 27.1299L60 30L36.9291 32.8701L51.2132 51.2132L32.8701 36.9291L30 60L27.1299 36.9291L8.7868 51.2132L23.0709 32.8701L0 30L23.0709 27.1299L8.7868 8.7868L27.1299 23.0709L30 0Z"
                  fill="#070604"
                />
              </svg>
              میکاپ عروس و
            </h1>
            <h2>فشن در ایران</h2>
          </section>
          <section className={styles.action}>
            <div className={styles.starPucker}>
              <Image
                width={35}
                height={35}
                src="/assets/images/star-pucker.svg"
                alt="star pucker"
              />
            </div>
            <p>
              مدرس تخصصی آموزش صفرتاصد و آپدیت دوره عروس و فشن بیش از ۲۰۰۰ تا
              هنرجوی حضوری و آنلاین از سرتاسر ایران
            </p>
            <Link href="#courses">
              <button className={styles.startBTN}>یک شروع شگفت انگیز</button>
            </Link>
            <div className={styles.happyCustomers}>
              <div className={styles.profileContainer}>
                {[
                  "/assets/images/customer_1.jpg",
                  "/assets/images/customer_3.jpg",
                  "/assets/images/customer_2.jpg",
                ].map((src, index) => (
                  <a href="#comments" key={index}>
                    <Image
                      width={70}
                      height={70}
                      className={styles.profile}
                      src={src}
                      alt={`satisfied customer ${index + 1}`}
                      key={index}
                    />
                  </a>
                ))}
              </div>
              <div className={styles.countAndViewContainer}>
                <button>
                  <span>۱K+</span>مشتری راضی
                </button>
              </div>
            </div>
          </section>
        </div>
        <div className={styles.imageContainer}>
            <Image
              className={styles.heroImage}
              width={600}
              height={700}
              src="/assets/images/hero.svg"
              alt="hero-model"
              priority={true}
            />
        </div>
      </div>
    </div>
  );
};

export default Hero;
